
/**
【位运算符】
& --按位与
    &&逻辑与也叫并且
    &&和&的含义完全不同
    
|--按位或
    ||逻辑或
~  -->按位取反
    ~i 把i变量所有的二进制位取反
^-->按位异或
<<  -->按位左移，左移n为位相当于乘以2的n次方
    
>>  -->按位右移，右移n为位相当于除以2的n次方
位运算的现实意义：通过位运算可以对数据的操作精确到每一位
  //按位与
#include<stdio.h>
void main()
{
    int i= -5;
    int j = 10;
    int k;
    
    k = i & j;
    printf("%d\n",k);
    
    k = i && j;//k的值只能是1或0，&&是逻辑运算符，逻辑运算符真用1表示，假用零表示
    printf("%d\n",k);
}
  **/
//按位或
#include<stdio.h>
void main()
{
    int i= 3;
    int j = 5;
    int k;
    
    k = i | j;
    printf("%d\n",k);
}
