
***************************************************************************************************************************
												1.ST概述/衡量算法的标准
***************************************************************************************************************************
数据结构定义
			把现实中大量复杂的问题以特定的数据类型和特定的存储结构保存的主存储器（内存）中，以及在此基础上为实现某个
			功能（如查找、删除元素，对元素排序）而执行的相应操作。这个相应的操作也叫算法
			
		数据结构 = 个体存储 + 个体关系
		
		算法=对存储数据的操作
		
			衡量算法的标准：
							1.时间复杂度 即程序大概执行次数，而非执行时间长短
							2.空间复杂度 算法执行过程中，大概所占用的内存
							3.难易程度
							4.健壮性	
	
数据结构中没有“堆”的概念，“堆栈”就是指“栈”;
