***************************************************************************************************************************
												29.复习 2012.3.27								
***************************************************************************************************************************
数据结构：
		狭义：
			专门研究数据的存储
			数据的存储包含两方面：个体的存储+个体关系的存储
		广义：
			包含数据的 存储和操作
			对存储数据的操作就是  算法
			
算法：
		狭义：
			和数据的存储方式密切相关
		广义：
			和数据的存储方式无关   这也就是  泛型  的思想


数据的存储结构：
		线性：
			连续存储  【数组】
				优点：
					存取速度快，空间有限制
				缺点：
					插入删除元素速度慢
			离散存储  【链表】
				优点：
					空间无限制，插入删除元素速度快
				缺点：
					数据存储慢
	  非线性：
			树和图